---
kind: type
id: T:Autodesk.Revit.DB.Visual.Gradient
source: html/2b517b49-c915-74a9-bb6f-2a233d6706be.htm
---
# Autodesk.Revit.DB.Visual.Gradient

A static class that provides access to the property names that appear in the Gradient visual asset schema.

## Syntax (C#)
```csharp
public static class Gradient
```